ARMmbed/DAPLink/shared/cmsis/TARGET_Freescale/include/device/MK20D5/MK20D5_usb.h
//! @brief Format value for bitfield USB_USBTRC0_USBRESET.
#define BF_USB_USBTRC0_USBRESET(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint8_t) << BP_USB_USBTRC0_USBRESET), uint8_t) & BM_USB_USBTRC0_USBRESET)

#ifndef __LANGUAGE_ASM__
//! @brief Set the USBRESET field to a new value.
#define BW_USB_USBTRC0_USBRESET(v) (BITBAND_ACCESS8(HW_USB_USBTRC0_ADDR, BP_USB_USBTRC0_USBRESET) = (v))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USB_USBFRMADJUST - Frame Adjust Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USB_USBFRMADJUST - Frame Adjust Register (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_usb_usbfrmadjust
{
    uint8_t U;
    struct _hw_usb_usbfrmadjust_bitfields
    {
        uint8_t ADJ : 8;               //!< [7:0] Frame Adjustment
    } B;
} hw_usb_usbfrmadjust_t;
#endif

/*!
 * @name Constants and macros for entire USB_USBFRMADJUST register
 */
//@{
#define HW_USB_USBFRMADJUST_ADDR (REGS_USB_BASE + 0x114U)

#ifndef __LANGUAGE_ASM__
#define HW_USB_USBFRMADJUST      (*(__IO hw_usb_usbfrmadjust_t *) HW_USB_USBFRMADJUST_ADDR)
#define HW_USB_USBFRMADJUST_RD() (HW_USB_USBFRMADJUST.U)
#define HW_USB_USBFRMADJUST_WR(v) (HW_USB_USBFRMADJUST.U = (v))
#define HW_USB_USBFRMADJUST_SET(v) (HW_USB_USBFRMADJUST_WR(HW_USB_USBFRMADJUST_RD() |  (v)))
#define HW_USB_USBFRMADJUST_CLR(v) (HW_USB_USBFRMADJUST_WR(HW_USB_USBFRMADJUST_RD() & ~(v)))
#define HW_USB_USBFRMADJUST_TOG(v) (HW_USB_USBFRMADJUST_WR(HW_USB_USBFRMADJUST_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USB_USBFRMADJUST bitfields
 */

/*!
 * @name Register USB_USBFRMADJUST, field ADJ[7:0] (RW)
 *
 * In Host mode, the frame adjustment is a twos complement number that adjusts
 * the period of each USB frame in 12-MHz clock periods. A SOF is normally
 * generated every 12,000 12-MHz clock cycles. The Frame Adjust Register can adjust this
 * by -128 to +127 to compensate for inaccuracies in the USB 48-MHz clock.
 * Changes to the ADJ bit take effect at the next start of the next frame.
 */
//@{
#define BP_USB_USBFRMADJUST_ADJ (0U)       //!< Bit position for USB_USBFRMADJUST_ADJ.
#define BM_USB_USBFRMADJUST_ADJ (0xFFU)    //!< Bit mask for USB_USBFRMADJUST_ADJ.
#define BS_USB_USBFRMADJUST_ADJ (8U)       //!< Bit field size in bits for USB_USBFRMADJUST_ADJ.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USB_USBFRMADJUST_ADJ field.
#define BR_USB_USBFRMADJUST_ADJ (HW_USB_USBFRMADJUST.B.ADJ)
#endif

//! @brief Format value for bitfield USB_USBFRMADJUST_ADJ.
#define BF_USB_USBFRMADJUST_ADJ(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint8_t) << BP_USB_USBFRMADJUST_ADJ), uint8_t) & BM_USB_USBFRMADJUST_ADJ)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ADJ field to a new value.
#define BW_USB_USBFRMADJUST_ADJ(v) (HW_USB_USBFRMADJUST_WR((HW_USB_USBFRMADJUST_RD() & ~BM_USB_USBFRMADJUST_ADJ) | BF_USB_USBFRMADJUST_ADJ(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// hw_usb_t - module struct
//-------------------------------------------------------------------------------------------
/*!
 * @brief All USB module registers.
 */
#ifndef __LANGUAGE_ASM__
#pragma pack(1)
typedef struct _hw_usb
{
    __I hw_usb_perid_t PERID;              //!< [0x0] Peripheral ID Register
    uint8_t _reserved0[3];
    __I hw_usb_idcomp_t IDCOMP;            //!< [0x4] Peripheral ID Complement Register
    uint8_t _reserved1[3];
    __I hw_usb_rev_t REV;                  //!< [0x8] Peripheral Revision Register
    uint8_t _reserved2[3];
    __I hw_usb_addinfo_t ADDINFO;          //!< [0xC] Peripheral Additional Info Register
    uint8_t _reserved3[3];
    __IO hw_usb_otgistat_t OTGISTAT;       //!< [0x10] OTG Interrupt Status Register
    uint8_t _reserved4[3];
    __IO hw_usb_otgicr_t OTGICR;           //!< [0x14] OTG Interrupt Control Register
    uint8_t _reserved5[3];
    __IO hw_usb_otgstat_t OTGSTAT;         //!< [0x18] OTG Status Register
    uint8_t _reserved6[3];
    __IO hw_usb_otgctl_t OTGCTL;           //!< [0x1C] OTG Control Register
    uint8_t _reserved7[99];
    __IO hw_usb_istat_t ISTAT;             //!< [0x80] Interrupt Status Register
    uint8_t _reserved8[3];
    __IO hw_usb_inten_t INTEN;             //!< [0x84] Interrupt Enable Register
    uint8_t _reserved9[3];
    __IO hw_usb_errstat_t ERRSTAT;         //!< [0x88] Error Interrupt Status Register
    uint8_t _reserved10[3];
    __IO hw_usb_erren_t ERREN;             //!< [0x8C] Error Interrupt Enable Register
    uint8_t _reserved11[3];
    __I hw_usb_stat_t STAT;                //!< [0x90] Status Register
    uint8_t _reserved12[3];
    __IO hw_usb_ctl_t CTL;                 //!< [0x94] Control Register
    uint8_t _reserved13[3];
    __IO hw_usb_addr_t ADDR;               //!< [0x98] Address Register
    uint8_t _reserved14[3];
    __IO hw_usb_bdtpage1_t BDTPAGE1;       //!< [0x9C] BDT Page Register 1
    uint8_t _reserved15[3];
    __IO hw_usb_frmnuml_t FRMNUML;         //!< [0xA0] Frame Number Register Low
    uint8_t _reserved16[3];
    __IO hw_usb_frmnumh_t FRMNUMH;         //!< [0xA4] Frame Number Register High
    uint8_t _reserved17[3];
    __IO hw_usb_token_t TOKEN;             //!< [0xA8] Token Register
    uint8_t _reserved18[3];
    __IO hw_usb_softhld_t SOFTHLD;         //!< [0xAC] SOF Threshold Register
    uint8_t _reserved19[3];
    __IO hw_usb_bdtpage2_t BDTPAGE2;       //!< [0xB0] BDT Page Register 2
    uint8_t _reserved20[3];
    __IO hw_usb_bdtpage3_t BDTPAGE3;       //!< [0xB4] BDT Page Register 3
    uint8_t _reserved21[11];
    struct {
        __IO hw_usb_endptn_t ENDPTn;       //!< [0xC0] Endpoint Control Register
        uint8_t _reserved0[3];
    } ENDPOINT[16];
    __IO hw_usb_usbctrl_t USBCTRL;         //!< [0x100] USB Control Register
    uint8_t _reserved22[3];
    __I hw_usb_observe_t OBSERVE;          //!< [0x104] USB OTG Observe Register
    uint8_t _reserved23[3];
    __IO hw_usb_control_t CONTROL;         //!< [0x108] USB OTG Control Register
    uint8_t _reserved24[3];
    __IO hw_usb_usbtrc0_t USBTRC0;         //!< [0x10C] USB Transceiver Control Register 0
    uint8_t _reserved25[7];
    __IO hw_usb_usbfrmadjust_t USBFRMADJUST; //!< [0x114] Frame Adjust Register
} hw_usb_t;
#pragma pack()

//! @brief Macro to access all USB registers.
//! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
//!     use the '&' operator, like <code>&HW_USB</code>.
#define HW_USB         (*(hw_usb_t *) REGS_USB_BASE)
#endif

#endif // __HW_USB_REGISTERS_H__
// v22/130726/0.9
// EOF
